byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (phase1 phase2);

pMin                pMin                [ 1 -1 -2 0 0 0 0 ] 10000;

// sigma               sigma               [ 1 0 -2 0 0 0 0 ]  0.07;

sigma
{
    type    liquidProperties;
    phase   phase1;
}

// sigma
// {
//     type    temperatureDependent;
//     sigma   table
//     (
//         (273.15 0.02410053)
//         (370.00 0.01562685)
//     );
// }

// ************************************************************************* //
