byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/constant/thermophysicalProperties.phase2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    properties      liquid;
    energy          sensibleInternalEnergy;
}

mixture
{
//     C2H5OH;
    H2O;
}

// thermoType
// {
//     type            heRhoThermo;
//     mixture         pureMixture;
//     transport       const;
//     thermo          hConst;
//     equationOfState perfectGas;
//     specie          specie;
//     energy          sensibleInternalEnergy;
// }
// 
// mixture
// {
//     specie
//     {
//         nMoles      1;
//         molWeight   28.9;
//     }
//     thermodynamics
//     {
//         Cp          1007;
//         Hf          0;
//     }
//     transport
//     {
//         mu          18.4e-06;
//         Pr          0.712;
//     }
// }


// ************************************************************************* //
