byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            zeroGradient;
        value           uniform 0;
    }
    front
    {
        type            zeroGradient;
        value           uniform 0;
    }
    left
    {
        type            zeroGradient;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }
    right
    {
//         type            pressureInletOutletVelocity;
//         phi             phi;
//         tangentialVelocity (0 0 0);
//         value           uniform (0 0 0);
        type            pressureNormalInletOutletVelocity;
        phi             phi;
        rho             rho;
        value           uniform (0 0 0);
    }
    top
    {
        type            zeroGradient;
        value           uniform 0;
    }
    lid
    {
        type            noSlip;
    }
    "wall.*"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
