byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            zeroGradient;
        value           uniform 0;
    }
    front
    {
        type            zeroGradient;
        value           uniform 0;
    }
    left
    {
        type            totalPressure;
//         rho             thermo:rho;
        rho             rho;
        p0              uniform 0;
    }
    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }
    right
    {
        type            totalPressure;
//         rho             thermo:rho;
        rho             rho;
        p0              uniform 1e4;
    }
    top
    {
        type            zeroGradient;
        value           uniform 0;
    }
    lid
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    "wall.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}


// ************************************************************************* //
