byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            zeroGradient;
        value           uniform 0;
    }
    front
    {
        type            zeroGradient;
        value           uniform 0;
    }
    left
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }
    right
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    top
    {
        type            zeroGradient;
        value           uniform 0;
    }
    lid
    {
        type            fixedValue;
        value           uniform 300;
    }
    "wall.*"
    {
        type            fixedValue;
        value           uniform 300;
    }
}

// ************************************************************************* //
