byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/0/alpha.phase1.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.phase1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            zeroGradient;
        value           uniform 0;
    }
    front
    {
        type            zeroGradient;
        value           uniform 0;
    }
    left
    {
        type            zeroGradient;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }
    right
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }
    top
    {
        type            zeroGradient;
        value           uniform 0;
    }
    lid
    {
        type            constantAlphaContactAngle;
        theta0          135;
        limit           gradient;
        value           uniform 0;
    }
    "wall.*"
    {
        type            constantAlphaContactAngle;
        theta0          135;
        limit           gradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
