byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.phase1.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0.0;

        nAlphaSmoothers     3;
        cSmCoeff            0.5;
        cShCoeff            0.3;
        nKappaSmoothers     2;
        cPhicFilterCoeff    0.1;
        cPhicThresholdCoeff 0.01;
    }

    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol              0.0;
//         solver          PBiCGStab;
//         preconditioner  DIC;
//         tolerance       1e-05;
//         relTol          0.0;
//         solver          GAMG;
//         tolerance       1e-05;
//         relTol          0.0;
//         smoother        GaussSeidel;
    }

    pcorrFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol              0.0;
//         solver          PBiCGStab;
//         preconditioner  DIC;
//         tolerance       1e-05;
//         relTol          0.0;
//         solver          GAMG;
//         tolerance       1e-05;
//         relTol          0.0;
//         smoother        GaussSeidel;
    }

    p_rgh
    {
//         solver          PCG;
//         preconditioner  DIC;
//         tolerance       1e-10;
//         relTol              0.05;
//         minIter         2;
//         maxIter         100;

//         solver          PBiCGStab;
//         preconditioner  DIC;
//         tolerance       1e-10;
//         relTol          0.05;
//         minIter         2;
//         maxIter         100;

        solver          GAMG;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
        tolerance       1e-10;
        relTol          0.05;
        minIter         2;
        maxIter         100;

//         solver          PCG;
//         preconditioner
//         {
//             preconditioner  GAMG;
//             tolerance       1e-8;
//             relTol          0.0;
//             nVcycles        2;
//             smoother        GaussSeidel;
//             nPreSweeps      0;
//             nPostSweeps     2;
//             nFinestSweeps   2;
//             cacheAgglomeration false;
//             nCellsInCoarsestLevel 10;
//             agglomerator    faceAreaPair;
//             mergeLevels     1;
//         }
//         tolerance       1e-10;
//         relTol          0.05;
//         minIter         2;
//         maxIter         100;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0.0;
    }

    pc
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-20;
        relTol          0.01;
    }

    pcFinal
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-20;
        relTol          0.0;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.0;
    }

    "T.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0.0;
    }
}

PIMPLE
{
    momentumPredictor           no;
    nOuterCorrectors            2;
    nCorrectors                 3;
    nNonOrthogonalCorrectors    1;

    pRefCell                    0;
    pRefValue                   1e5;

    outerCorrectorResidualControl
    {
        p_rgh
        {
            tolerance           1e-6;
            relTol              0;
        }

        U
        {
            tolerance           1e-6;
            relTol              0;
        }

        T
        {
            tolerance           1e-6;
            relTol              0;
        }
    }

//     residualControl
//     {
//         p_rgh                   1e-4;
//         U                       1e-4;
//         T                       1e-4;
//     }

    turbOnFinalIterOnly on;
}

relaxationFactors
{
    fields
    {
//         p_rgh                   0.3;
//         p_rghFinal              1;
//         phic                    0.7;
//         phicFinal               1;
    }
    equations
    {
//         U                       0.7;
//         UFinal                  1;
        ".*" 1;
    }
}


// ************************************************************************* //
