byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/system/snappyHexMeshSrc/eMeshList
{
    file "model.eMesh";
    level 1;
}
