byAlex_regularPorousMedia-master/channelWithObstaclesV10/src/system/snappyHexMeshSrc/refinementSurfacesList
walls
{
    level  (1 1);
    patchInfo{type wall;}
}
